# lambda 表达式练习
power = {"吕布": 999, "关羽": 888, "刘备": 666, "张飞": 900, "赵云": 789, "不二如是": 999}

# 请 lambda 表达式和 filter() 函数配合，替换下面的代码
# greater = []
# for k, v in power.items():
#     if v > 800:
#         greater.append((k, v))
# 请 lambda 表达式和 filter() 函数配合，替换下面的代码
# ———————————————————————————————————————————————————————————————————————————————————
greater = list(filter(lambda x : x[1] > 800, power.items()))
# ———————————————————————————————————————————————————————————————————————————————————

print(greater)
# [('吕布', 999), ('关羽', 888), ('张飞', 900), ('不二如是', 999)]


# 字典获取值
# dict.get(key, default=None)
# 返回指定键的值，如果键不在字典中返回 default 设置的默认值
members = {
    "鱼C工作室" : {"小甲鱼":83, "不二如是":89, "二师兄":64, "小师妹":75, "鱼小二":96},
    "复仇者联盟" : {"钢铁侠":85, "绿巨人":39, "黑寡妇":82, "鹰眼":73, "雷神":99},
    "奥特曼家族" : {"迪迦":99, "艾斯":84, "泰罗":63, "佐菲":78, "赛文":78}}

# 请在此处添加一行代码，完成题目要求，并将结果保存在变量 x 中
# ———————————————————————————————————————————————————————————————————————————————————
x = [':'.join((i, min(members[i].items(), key = lambda x:x[1])[0])) for i in members]
# ———————————————————————————————————————————————————————————————————————————————————
# for i in members:
#     i, min(members[i].items(), key = lambda x:x[1])[0]

print(x)
# ['鱼C工作室:二师兄', '复仇者联盟:绿巨人', '奥特曼家族:泰罗']
