# 摩斯密码

c_table = [".-", "-...", "-.-.", "-..", ".", "..-.",
           "--.", "....", "..", ".---", "-.-", ".-..",
           "--", "-.", "---", ".--.", "--.-", ".-.",
           "...", "-", "..-", "...-", ".--", "-..-",
           "-.--", "--.."]
d_table = ["A", "B", "C", "D", "E", "F", "G", "H", "I",
           "J", "K", "L", "M", "N", "O", "P", "Q", "R",
           "S", "T", "U", "V", "W", "X", "Y", "Z"]
code = input("请输入摩斯密码：")
split_code = code.split(" ")

result = [d_table[c_table.index(each)] for each in split_code]
print(result)
# 请输入摩斯密码：.. --
# ['I', 'M']

# 通过字典
c_table = {".-":"A", "-...":"B", "-.-.":"C", "-..":"D", ".":"E", "..-.":"F",
           "--.":"G", "....":"H", "..":"I", ".---":"J", "-.-":"K", ".-..":"L",
           "--":"M", "-.":"N", "---":"O", ".--.":"P", "--.-":"Q", ".-.":"R",
           "...":"S", "-":"T", "..-":"U", "...-":"V", ".--":"W", "-..-":"X",
           "-.--":"Y", "--..":"Z"}
code = input("请输入摩斯密码：")
split_code = code.split(" ")

result = [c_table[each] for each in split_code]
print(result)
# 请输入摩斯密码：.. --
# ['I', 'M']
